app/views/owns/_form.html.erb

  <%= f.collection_select :person_id, Person.all, :id, :name, :prompt => "Select person" %><br />
  <%= f.collection_select :model_id, Model.all, :id, :name, :prompt => "Select disc model" %><br />
---
SELECT "models".* FROM "models"