app/views/models/_form.html.erb

  <p>
    <%= f.collection_select :disc_type_id, DiscType.all, :id, :name, :prompt => "Select disc type" %>
---
SELECT "disc_types".* FROM "disc_types"

    <%= f.text_field :name %> &nbsp;
    <%= f.collection_select :make_id, Make.all, :id, :name, :prompt => "Select disc maker" %>
---
SELECT "makes".* FROM "makes"