app/controllers/disc_types_controller.rb

SELECT "disc_types".* FROM "disc_types"
---
  def index
    @disc_types = DiscType.all

SELECT  "disc_types".* FROM "disc_types" WHERE "disc_types"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @disc_type = DiscType.find(params[:id])

SELECT  "disc_types".* FROM "disc_types" WHERE "disc_types"."id" = $1 LIMIT 1  [["id", 4]]
---
  def edit
    @disc_type = DiscType.find(params[:id])

INSERT INTO "disc_types" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Putter"], ["created_at", "2015-09-10 14:39:58.363082"], ["updated_at", "2015-09-10 14:39:58.363082"]]
---
  def create
    @disc_type = DiscType.new(disc_type_params)

    if @disc_type.save

SELECT  "disc_types".* FROM "disc_types" WHERE "disc_types"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "disc_types" WHERE "disc_types"."id" = $1  [["id", 5]]
---
  def destroy
    @disc_type = DiscType.find(params[:id])
    @disc_type.destroy