app/controllers/makes_controller.rb

SELECT "makes".* FROM "makes"
---
  def index
    @makes = Make.all

SELECT  "makes".* FROM "makes" WHERE "makes"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @make = Make.find(params[:id])

SELECT  "makes".* FROM "makes" WHERE "makes"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @make = Make.find(params[:id])

INSERT INTO "makes" ("name", "logo_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Discraft"], ["logo_url", "http://www.discraft.com/downloads/discraft_logo_jpg_color.jpg"], ["created_at", "2015-09-10 18:23:13.239644"], ["updated_at", "2015-09-10 18:23:13.239644"]]
---
  def create
    @make = Make.new(make_params)

    if @make.save

SELECT  "makes".* FROM "makes" WHERE "makes"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "makes" WHERE "makes"."id" = $1  [["id", 1]]
---
  def destroy
    @make = Make.find(params[:id])
    @make.destroy