app/controllers/models_controller.rb

  def index
    @models = Model.all
---
SELECT "models".* FROM "models"

  def show
    @model = Model.find(params[:id])
---
SELECT  "models".* FROM "models" WHERE "models"."id" = $1 LIMIT 1  [["id", 2]]

  def edit
    @model = Model.find(params[:id])
---
SELECT  "models".* FROM "models" WHERE "models"."id" = $1 LIMIT 1  [["id", 2]]

  def create
    @model = Model.new(make_params)

    if @model.save
---
INSERT INTO "models" ("name", "make_id", "stability", "speed", "glide", "turn", "fade", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"  [["name", "XS"], ["make_id", 5], ["stability", 1], ["speed", 1], ["glide", 1], ["turn", -2], ["fade", 0], ["created_at", "2015-09-11 13:02:10.600104"], ["updated_at", "2015-09-11 13:02:10.600104"]]

  def update
    @model = Model.find(params[:id])

    if @model.update(make_params)
---
SELECT  "models".* FROM "models" WHERE "models"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "models" SET "speed" = $1, "glide" = $2, "turn" = $3, "fade" = $4, "updated_at" = $5 WHERE "models"."id" = $6  [["speed", 1], ["glide", 1], ["turn", -1], ["fade", 1], ["updated_at", "2015-09-14 19:26:51.172827"], ["id", 3]]