app/controllers/owns_controller.rb

SELECT "owns".* FROM "owns"
---
  def index
    @owns = Own.all

SELECT  "owns".* FROM "owns" WHERE "owns"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @own = Own.find(params[:id])

SELECT  "owns".* FROM "owns" WHERE "owns"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @own = Own.find(params[:id])

INSERT INTO "owns" ("model_id", "person_id", "inventory", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["model_id", 2], ["person_id", 1], ["inventory", 1], ["created_at", "2015-09-14 19:44:45.403155"], ["updated_at", "2015-09-14 19:44:45.403155"]]
---
  def create
    @own = Own.new(own_params)

    if @own.save

SELECT  "owns".* FROM "owns" WHERE "owns"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "owns" SET "inventory" = $1, "updated_at" = $2 WHERE "owns"."id" = $3  [["inventory", 3], ["updated_at", "2015-09-14 19:50:49.908363"], ["id", 1]]
---
  def update
    @own = Own.find(params[:id])

    if @own.update(own_params)